import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = os.getenv('BOT_TOKEN')
BOT_INVITE_URL = os.getenv("BOT_INVITE_URL")

# Время жизни сообщений бота в основной группе (в секундах)
MESSAGE_LIFETIME_SECONDS = 30

# Регулярные выражения для матов
PROFANITY_REGEX = r"(?iux)(?<![а-яё])(?:(?:(?:у|[нз]а|(?:хитро|не)?вз?[ыьъ]|с[ьъ]|(?:и|ра)[зс]ъ?|(?:о[тб]|п[оа]д)[ьъ]?|(?:\S(?=[а-яё]))+?[оаеи-])-?)?(?:[её](?:б(?!о[рй]|рач)|п[уа](?:ц|тс))|и[пб][ае][тцд][ьъ]).*?|(?:(?:н[иеа]|(?:ра|и)[зс]|[зд]?[ао](?:т|дн[оа])?|с(?:м[еи])?|а[пб]ч|в[ъы]?|пр[еи])-?)?ху(?:[яйиеёю]|л+и(?!ган)).*?|бл(?:[эя]|еа?)(?:[дт][ьъ]?)?|\S*?(?:п(?:[иеё]зд|ид[аое]?р|ед(?:р(?!)|[аое]р|ик)|ох)|бля(?:|тс)|[ое]ху[яйиеё]|хуйн).*?|(?:о[тб]?|про|на|вы)?м(?:анд(?:[textu]|[ао]|^.*?|юк(?:ов|[ауи])?|е[нт]ь|ища)|уд(?:[яаиое].+?|е?н(?:[ьюия]|ей))|[ао]л[ао]ф[ьъ](?:[яиюе]|[еёо]й))|елд[ауые].*?|ля[тд]|(?:[нз]а|по)х)(?![а-яё])"

# Регулярное выражение для ссылок
LINK_REGEX = r"(?i)\b((?:https?://|www\.)\S+|\S+\.[a-z]{2,}(?:/\S*)?)"

# Настройки по умолчанию для новых групп
DEFAULT_SETTINGS = {
    'greeting_enabled': True,  # Приветственные и прощальные сообщения
    'profanity_filter': True,  # Фильтр матов
    'toxicity_filter': False,  # Фильтр токсичности
    'file_filter': True,  # Фильтр опасных файлов
    'report_system': False,  # Система жалоб
    'link_filter': False,  # Фильтр ссылок
    'captcha_enabled': True  # Капча для новых пользователей
}